{"a@a.com":{"name":"wow","password":{"iv":"dd58b90914d1a4dcf98ce01c0cd114d5","encryptedData":"a4b3b3b3b21e40feb3744388de59bb97"},"documents":{"0":{"name":"cheese","delta":{"ops":[{"attributes":{"bold":true},"insert":"Microsoft was investigating its co-founder Bill Gates over a 20-year-old affair shortly before he stepped down from the company's board last year."},{"insert":"\n"},{"attributes":{"color":"#202122","italic":true},"insert":"The tech giant confirmed that it had launched a probe after concerns were reported about his behaviour."},{"insert":"\n"},{"attributes":{"color":"#202122","italic":true},"insert":"The firm said it held an investigation with a law firm and provided support to the employee who made the complaint."},{"insert":"\n"},{"attributes":{"color":"#202122","italic":true},"insert":"A spokesperson for Mr Gates denied that his decision to step back had anything to do with the investigation."},{"insert":"\n"},{"attributes":{"color":"#202122","italic":true},"insert":"News of the investigation emerged after "},{"attributes":{"bold":true,"color":"#3f3f42","link":"https://www.bbc.co.uk/news/world-us-canada-56975466"},"insert":"Bill and Melinda Gates announced their decision to divorce"},{"insert":" after 27 years of marriage.\nOn Monday, a spokesman for Microsoft said the software company had received a complaint in late 2019 that Mr Gates had \"sought to initiate an intimate relationship\" with a female employee in 2000.\n\"A committee of the board reviewed the concern, aided by an outside law firm, to conduct a thorough investigation,\" he said.\n\"Throughout the investigation, Microsoft provided extensive support to the employee who raised the concern,\" he said.\nThe investigation did not reach a conclusion, as Mr Gates stepped down from the board before it was completed.\n"},{"attributes":{"bold":true,"color":"#3f3f42","link":"https://www.bbc.co.uk/news/world-us-canada-56984733"},"insert":"Bill and Melinda Gates agreed 'separation contract' before announcing divorce"},{"attributes":{"list":"bullet"},"insert":"\n"},{"attributes":{"bold":true,"color":"#3f3f42","link":"https://www.bbc.co.uk/news/world-us-canada-56974222"},"insert":"Bill and Melinda Gates: A life in pictures"},{"attributes":{"list":"bullet"},"insert":"\n"},{"attributes":{"bold":true,"color":"#3f3f42","link":"https://www.linkedin.com/pulse/focusing-my-time-bill-gates?trk=portfolio_article-card_title"},"insert":"In a LinkedIn post in March of last year"},{"insert":", Mr Gates said that he took the decision so he could spend more time on his charity work with the Bill & Melinda Gates Foundation. It came three months after he was re-elected.\nAt the time, he wrote: \"With respect to Microsoft, stepping down from the board in no way means stepping away from the company. Microsoft will always be an important part of my life's work... I feel more optimistic than ever about the progress the company is making and how it can continue to benefit the world.\"\nHowever, the "},{"attributes":{"bold":true,"color":"#3f3f42","link":"https://www.wsj.com/articles/microsoft-directors-decided-bill-gates-needed-to-leave-board-due-to-prior-relationship-with-staffer-11621205803?mod=hp_lead_pos2"},"insert":"Wall Street Journal reported on Sunday"},{"insert":" that Microsoft's board had decided that Mr Gates's involvement with a female employee was inappropriate and he needed to step down.\nA spokeswoman for Mr Gates acknowledged the affair took place when asked by the newspaper, but denied it had anything to do his decision to step back.\n\"There was an affair almost 20 years ago which ended amicably,\" the spokeswoman said.\n\"Bill's decision to transition off the board was in no way related to this matter. In fact, he had expressed an interest in spending more time on his philanthropy starting several years earlier.\"\nThe Bill & Melinda Gates Foundation told the BBC that it stood by that statement.\n"},{"insert":{"video":"https://emp.bbc.com/emp/SMPj/2.42.4/iframe.html"}},{"insert":"\nmedia caption\nThe BBC's Michelle Fleury breaks down the story of Bill and Melinda Gates' relationship\nBill and Melinda Gates announced their decision to divorce earlier this month. The couple have spent billions on charitable causes around the world and have pledged to continue to work together at the foundation once their divorce is finalised.\n"},{"attributes":{"bold":true,"color":"#3f3f42","link":"https://www.bbc.co.uk/news/world-us-canada-56984733"},"insert":"US media reported"},{"insert":" that the two had agreed how to divide their property and assets before announcing their separation.\nMr Gates, 65, is the fourth wealthiest person in the world, according to Forbes, and is worth $124bn (£89bn).\nHe co-founded Microsoft - now the world's biggest software company - in the 1970s and remained full-time at the firm until 2008.\nThe couple's estate is believed to include multi-million dollar properties in the states of Washington, Florida and Wyoming. Their main residence is a lakeside mansion in Medina, Washington that is reported to be worth at least $127m.\n\n"}]}}}}}